laurigates/mcu-tinkering-lab/packages/esp32-projects/esp32s3-gemini-vision/sdkconfig.defaults
# XIAO ESP32-S3 Sense — Gemini Vision
CONFIG_IDF_TARGET="esp32s3"

# PSRAM (XIAO ESP32-S3 Sense has 8MB Octal PSRAM)
CONFIG_SPIRAM=y
CONFIG_SPIRAM_MODE_OCT=y
CONFIG_SPIRAM_SPEED_80M=y
CONFIG_SPIRAM_USE_MALLOC=y
CONFIG_SPIRAM_MALLOC_ALWAYSINTERNAL=16384
CONFIG_SPIRAM_MALLOC_RESERVE_INTERNAL=32768

# Flash (XIAO ESP32-S3 Sense has 8MB flash)
CONFIG_ESPTOOLPY_FLASHSIZE_8MB=y

# Custom partition table
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="partitions.csv"

# USB Serial/JTAG console (XIAO native USB-C)
CONFIG_ESP_CONSOLE_USB_SERIAL_JTAG=y

# Main task stack (WiFi + camera + httpd + HTTPS)
CONFIG_ESP_MAIN_TASK_STACK_SIZE=8192

# HTTP server tuning
CONFIG_HTTPD_MAX_URI_LEN=512
CONFIG_HTTPD_MAX_REQ_HDR_LEN=1024

# HTTPS client for Gemini API
CONFIG_ESP_HTTP_CLIENT_ENABLE_HTTPS=y
CONFIG_ESP_TLS_USING_MBEDTLS=y
CONFIG_MBEDTLS_CERTIFICATE_BUNDLE=y
CONFIG_MBEDTLS_CERTIFICATE_BUNDLE_DEFAULT_FULL=y

# Camera DMA isolated to Core 1
CONFIG_CAMERA_CORE1=y
CONFIG_CAMERA_DMA_BUFFER_SIZE_MAX=32768

# mDNS
CONFIG_MDNS_ENABLED=y

# Brownout disabled (camera + WiFi startup can dip voltage on some USB ports)
CONFIG_ESP_BROWNOUT_DET=n

# WiFi tuning — mirrors robocar-unified which runs reliably on XIAO S3 Sense.
# Larger RX buffers reduce drops during bursty traffic; amsdu/ampdu off avoids
# aggregation edge cases some APs mis-handle.
CONFIG_ESP_WIFI_STATIC_RX_BUFFER_NUM=10
CONFIG_ESP_WIFI_DYNAMIC_RX_BUFFER_NUM=32
CONFIG_ESP_WIFI_TX_BUFFER_TYPE=1
CONFIG_ESP_WIFI_DYNAMIC_TX_BUFFER_NUM=32
CONFIG_ESP_WIFI_AMPDU_TX_ENABLED=n
CONFIG_ESP_WIFI_AMPDU_RX_ENABLED=n
CONFIG_ESP_WIFI_AMSDU_TX_ENABLED=n
CONFIG_ESP_WIFI_NVS_ENABLED=y

# Cap TX power — in tight USB supplies the radio at max power can brown the
# 3.3V rail during handshake bursts, which presents as 4-way handshake timeout.
CONFIG_ESP_PHY_MAX_WIFI_TX_POWER=15

# Logging
CONFIG_LOG_DEFAULT_LEVEL_INFO=y
CONFIG_LOG_DEFAULT_LEVEL=3

# FreeRTOS
CONFIG_FREERTOS_HZ=1000
